docs/index.org
#+hugo_base_dir: ..

#+options: creator:t author:nil

* DONE About Me
  CLOSED: <2020-04-01 三 01:03>
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: post
  :EXPORT_FILE_NAME: about
  :EXPORT_HUGO_BUNDLE: /
  :EXPORT_HUGO_MENU: :menu main
  :END:
比较 geek，文档只看官方的，比如 MDN，javascript.info，绝大多数开发问题都可以
通过官方文档解决，github issue，stackoverflow 也是经常解决问题的工具

P.S. *正在找工作。。。*

*TL;DR*

2017 年开始折腾博客，用 Hexo 搭的，基本什么都没写，后来换 Hugo，托管在 ~coding.net~
，啥都没写，这个博客是今年 3 月份搭的，之前用 github.io 访问，经大佬指点，绑定了域名，之前用了两年的阿里云 ~.top~
域名过期
未续费，所以在 [[https://www.namecheap.com/support/knowledgebase/article.aspx/9645/2208/how-do-i-link-my-domain-to-github-pages][namecheap]] 注册了 ~.me~ 新域名，托管在 github page，而且其与 
/[[https://letsencrypt.org/][Let's Encrypt]]/ 有合作，自动 https 绿锁，
/Everything goes smoothly/ .

用 ox-hugo 写博客有一点不方便就是不支持 org-mode 的 [[https://github.com/kaushalmodi/ox-hugo/issues/162][codeRef]] ，希望
作者早点完成这个 feature 吧！

*看起来生活挺枯燥乏味的。。。*

